<?php

$local = require __DIR__ . '/local/params.php';

$params = [
    'adminEmail' => '',
    'GOOGLE_API_KEY' => '',

    'isoCodes' => [
        'ad'  =>
            [
                0      => 'Республика Адыгея',
                2      => '1',
                'iso'  => 'ad',
                'code' => 1179,
            ],
        'al'  =>
            [
                0      => 'Республика Алтай',
                2      => '4',
                'iso'  => 'al',
                'code' => 1184,
            ],
        'ba'  =>
            [
                0      => 'Республика Башкортостан',
                2      => '2,102',
                'iso'  => 'ba',
                'code' => 1180,
            ],
        'bu'  =>
            [
                0      => 'Республика Бурятия',
                2      => '3',
                'iso'  => 'bu',
                'code' => 1181,
            ],
        'da'  =>
            [
                0      => 'Республика Дагестан',
                2      => '5',
                'iso'  => 'da',
                'code' => 1182,
            ],
        'in'  =>
            [
                0      => 'Республика Ингушетия',
                2      => '6',
                'iso'  => 'in',
                'code' => 1174,
            ],
        'kb'  =>
            [
                0      => 'Кабардино-Балкарская республика',
                2      => '7',
                'iso'  => 'kb',
                'code' => 1183,
            ],
        'kl'  =>
            [
                0      => 'Республика Калмыкия',
                2      => '8',
                'iso'  => 'kl',
                'code' => 1185,
            ],
        'kc'  =>
            [
                0      => 'Карачаево-Черкесская республика',
                2      => '9',
                'iso'  => 'kc',
                'code' => 1191,
            ],
        'kr'  =>
            [
                0      => 'Республика Карелия',
                2      => '10',
                'iso'  => 'kr',
                'code' => 1186,
            ],
        'ko'  =>
            [
                0      => 'Республика Коми',
                2      => '11,111',
                'iso'  => 'ko',
                'code' => 1187,
            ],
        'cr'  =>
            [
                0      => 'Республика Крым',
                2      => '82',
                'iso'  => 'cr',
                'code' => 1109,
            ],
        'me'  =>
            [
                0      => 'Республика Марий Эл',
                2      => '12',
                'iso'  => 'me',
                'code' => 1188,
            ],
        'mo'  =>
            [
                0      => 'Республика Мордовия',
                2      => '13,113',
                'iso'  => 'mo',
                'code' => 1189,
            ],
        'sa'  =>
            [
                0      => 'Республика Саха (Якутия)',
                2      => '14',
                'iso'  => 'sa',
                'code' => 1198,
            ],
        'se'  =>
            [
                0      => 'Республика Северная Осетия — Алания',
                2      => '15',
                'iso'  => 'se',
                'code' => 1106,
            ],
        'ta'  =>
            [
                0      => 'Республика Татарстан',
                2      => '16,116',
                'iso'  => 'ta',
                'code' => 1192,
            ],
        'ty'  =>
            [
                0      => 'Республика Тыва',
                2      => '17',
                'iso'  => 'ty',
                'code' => 1193,
            ],
        'ud'  =>
            [
                0      => 'Удмуртская республика',
                2      => '18',
                'iso'  => 'ud',
                'code' => 1194,
            ],
        'kk'  =>
            [
                0      => 'Республика Хакасия',
                2      => '19',
                'iso'  => 'kk',
                'code' => 1195,
            ],
        'ce'  =>
            [
                0      => 'Чеченская республика',
                2      => '95',
                'iso'  => 'ce',
                'code' => 1196,
            ],
        'cu'  =>
            [
                0      => 'Чувашская республика',
                2      => '21,121',
                'iso'  => 'cu',
                'code' => 1197,
            ],
        'alt' =>
            [
                0      => 'Алтайский край',
                2      => '22',
                'iso'  => 'alt',
                'code' => 1101,
            ],
        'zab' =>
            [
                0      => 'Забайкальский край',
                2      => '75,8',
                'iso'  => 'zab',
                'code' => 1176,
            ],
        'kam' =>
            [
                0      => 'Камчатский край',
                2      => '41',
                'iso'  => 'kam',
                'code' => 1130,
            ],
        'kda' =>
            [
                0      => 'Краснодарский край',
                2      => '23, 93, 123',
                'iso'  => 'kda',
                'code' => 1103,
            ],
        'kya' =>
            [
                0      => 'Красноярский край',
                2      => '24, 124, 84, 88',
                'iso'  => 'kya',
                'code' => 1104,
            ],
        'per' =>
            [
                0      => 'Пермский край',
                2      => '59, 81, 159',
                'iso'  => 'per',
                'code' => 1157,
            ],
        'pri' =>
            [
                0      => 'Приморский край',
                2      => '25,125',
                'iso'  => 'pri',
                'code' => 1105,
            ],
        'sta' =>
            [
                0      => 'Ставропольский край',
                2      => '26,126',
                'iso'  => 'sta',
                'code' => 1107,
            ],
        'kha' =>
            [
                0      => 'Хабаровский край',
                2      => '27',
                'iso'  => 'kha',
                'code' => 1108,
            ],
        'amu' =>
            [
                0      => 'Амурская область',
                2      => '28',
                'iso'  => 'amu',
                'code' => 1110,
            ],
        'ark' =>
            [
                0      => 'Архангельская область',
                2      => '29',
                'iso'  => 'ark',
                'code' => 1111,
            ],
        'ast' =>
            [
                0      => 'Астраханская область',
                2      => '30',
                'iso'  => 'ast',
                'code' => 1112,
            ],
        'bel' =>
            [
                0      => 'Белгородская область',
                2      => '31',
                'iso'  => 'bel',
                'code' => 1114,
            ],
        'bry' =>
            [
                0      => 'Брянская область',
                2      => '32',
                'iso'  => 'bry',
                'code' => 1115,
            ],
        'vla' =>
            [
                0      => 'Владимирская область',
                2      => '33',
                'iso'  => 'vla',
                'code' => 1117,
            ],
        'vgg' =>
            [
                0      => 'Волгоградская область',
                2      => '34,134',
                'iso'  => 'vgg',
                'code' => 1118,
            ],
        'vlg' =>
            [
                0      => 'Вологодская область',
                2      => '35',
                'iso'  => 'vlg',
                'code' => 1119,
            ],
        'vor' =>
            [
                0      => 'Воронежская область',
                2      => '36,136',
                'iso'  => 'vor',
                'code' => 1120,
            ],
        'iva' =>
            [
                0      => 'Ивановская область',
                2      => '37',
                'iso'  => 'iva',
                'code' => 1124,
            ],
        'irk' =>
            [
                0      => 'Иркутская область',
                2      => '38, 138, 85',
                'iso'  => 'irk',
                'code' => 1125,
            ],
        'kgd' =>
            [
                0      => 'Калининградская область',
                2      => '39,91',
                'iso'  => 'kgd',
                'code' => 1127,
            ],
        'klu' =>
            [
                0      => 'Калужская область',
                2      => '40',
                'iso'  => 'klu',
                'code' => 1129,
            ],
        'kem' =>
            [
                0      => 'Кемеровская область',
                2      => '42,142',
                'iso'  => 'kem',
                'code' => 1132,
            ],
        'kir' =>
            [
                0      => 'Кировская область',
                2      => '43',
                'iso'  => 'kir',
                'code' => 1133,
            ],
        'kos' =>
            [
                0      => 'Костромская область',
                2      => '44',
                'iso'  => 'kos',
                'code' => 1134,
            ],
        'kgn' =>
            [
                0      => 'Курганская область',
                2      => '45',
                'iso'  => 'kgn',
                'code' => 1137,
            ],
        'krs' =>
            [
                0      => 'Курская область',
                2      => '46',
                'iso'  => 'krs',
                'code' => 1138,
            ],
        'len' =>
            [
                0      => 'Ленинградская область',
                2      => '47',
                'iso'  => 'len',
                'code' => 1141,
            ],
        'lip' =>
            [
                0      => 'Липецкая область',
                2      => '48',
                'iso'  => 'lip',
                'code' => 1142,
            ],
        'mag' =>
            [
                0      => 'Магаданская область',
                2      => '49',
                'iso'  => 'mag',
                'code' => 1144,
            ],
        'mos' =>
            [
                0      => 'Московская область',
                2      => '50, 90, 150, 190, 750',
                'iso'  => 'mos',
                'code' => 1146,
            ],
        'mur' =>
            [
                0      => 'Мурманская область',
                2      => '51',
                'iso'  => 'mur',
                'code' => 1147,
            ],
        'niz' =>
            [
                0      => 'Нижегородская область',
                2      => '52,152',
                'iso'  => 'niz',
                'code' => 1122,
            ],
        'ngr' =>
            [
                0      => 'Новгородская область',
                2      => '53',
                'iso'  => 'ngr',
                'code' => 1149,
            ],
        'nvs' =>
            [
                0      => 'Новосибирская область',
                2      => '54,154',
                'iso'  => 'nvs',
                'code' => 1150,
            ],
        'oms' =>
            [
                0      => 'Омская область',
                2      => '55',
                'iso'  => 'oms',
                'code' => 1152,
            ],
        'ore' =>
            [
                0      => 'Оренбургская область',
                2      => '56',
                'iso'  => 'ore',
                'code' => 1153,
            ],
        'orl' =>
            [
                0      => 'Орловская область',
                2      => '57',
                'iso'  => 'orl',
                'code' => 1154,
            ],
        'pnz' =>
            [
                0      => 'Пензенская область',
                2      => '58',
                'iso'  => 'pnz',
                'code' => 1156,
            ],
        'psk' =>
            [
                0      => 'Псковская область',
                2      => '60',
                'iso'  => 'psk',
                'code' => 1158,
            ],
        'ros' =>
            [
                0      => 'Ростовская область',
                2      => '61,161',
                'iso'  => 'ros',
                'code' => 1160,
            ],
        'rya' =>
            [
                0      => 'Рязанская область',
                2      => '62',
                'iso'  => 'rya',
                'code' => 1161,
            ],
        'sam' =>
            [
                0      => 'Самарская область',
                2      => '63,163',
                'iso'  => 'sam',
                'code' => 1136,
            ],
        'sar' =>
            [
                0      => 'Саратовская область',
                2      => '64,164',
                'iso'  => 'sar',
                'code' => 1163,
            ],
        'sak' =>
            [
                0      => 'Сахалинская область',
                2      => '65',
                'iso'  => 'sak',
                'code' => 1164,
            ],
        'sve' =>
            [
                0      => 'Свердловская область',
                2      => '66, 96, 196',
                'iso'  => 'sve',
                'code' => 1165,
            ],
        'smo' =>
            [
                0      => 'Смоленская область',
                2      => '67',
                'iso'  => 'smo',
                'code' => 1166,
            ],
        'tam' =>
            [
                0      => 'Тамбовская область',
                2      => '68',
                'iso'  => 'tam',
                'code' => 1168,
            ],
        'tve' =>
            [
                0      => 'Тверская область',
                2      => '69',
                'iso'  => 'tve',
                'code' => 1128,
            ],
        'tom' =>
            [
                0      => 'Томская область',
                2      => '70',
                'iso'  => 'tom',
                'code' => 1169,
            ],
        'tul' =>
            [
                0      => 'Тульская область',
                2      => '71',
                'iso'  => 'tul',
                'code' => 1170,
            ],
        'tyu' =>
            [
                0      => 'Тюменская область',
                2      => '72',
                'iso'  => 'tyu',
                'code' => 1171,
            ],
        'uly' =>
            [
                0      => 'Ульяновская область',
                2      => '73,173',
                'iso'  => 'uly',
                'code' => 1173,
            ],
        'che' =>
            [
                0      => 'Челябинская область',
                2      => '74,174',
                'iso'  => 'che',
                'code' => 1175,
            ],
        'yar' =>
            [
                0      => 'Ярославская область',
                2      => '76',
                'iso'  => 'yar',
                'code' => 1178,
            ],
        'mow' =>
            [
                0      => 'Москва',
                2      => '77, 97, 99, 177, 197, 199, 777',
                'iso'  => 'mow',
                'code' => 1145,
            ],
        'spe' =>
            [
                0      => 'Санкт-Петербург',
                2      => '78, 98, 178',
                'iso'  => 'spe',
                'code' => 1140,
            ],
        'sev' =>
            [
                0      => 'Севастополь',
                2      => '92',
                'iso'  => 'sev',
                'code' => 1190,
            ],
        'yev' =>
            [
                0      => 'Еврейская автономная область',
                2      => '79',
                'iso'  => 'yev',
                'code' => 1199,
            ],
        'khm' =>
            [
                0      => 'Ханты-Мансийский автономный округ - Югра',
                2      => '86,186',
                'iso'  => 'khm',
                'code' => 1162,
            ],
        'chu' =>
            [
                0      => 'Чукотский автономный округ',
                2      => '87',
                'iso'  => 'chu',
                'code' => 1177,
            ],
        'yan' =>
            [
                0      => 'Ямало-Ненецкий автономный округ',
                2      => '89',
                'iso'  => 'yan',
                'code' => 1172,
            ],
    ],
];

return \yii\helpers\ArrayHelper::merge($params, $local);
